#include <stdio.h>

int main(int argc, char *argv[])
{

    int apt[2][2][2];

    /*
	한일 아파트는 101동 102동이 있습니다.
	아파트는 5층 건물이죠.
	이 아파트의 세대주를 입력받아 출력하세요.
	[][]
	[][]
	[][]
	[][]
	[][]

	[][]
	[][]
	[][]
	[][]
	[][]
	*/
    char people[11]; // 각 세대주를 입력받는다.

    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 2; j++)
        {
            for (int k = 0; k < 2; k++)
            {
                printf("%d동 %d층 %d호실에 사는 세대주 분은 성함을 입력해주세요 : ", i + 1, j + 1, k + 1);
                scanf_s("%s", people, sizeof(people));
                apt[i][j][k] = people;
            }
        }
    }

    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            for (int k = 0; k < 2; k++)
            {
                printf("%d동 %d층 %d호실에 사는 세대주 분의 성함은 %d입니다. : ", i + 1, j + 1, k + 1, apt[i][j][k]);
            }
        }
    }
    return 0;
    /*
	// 학생 3명에게 수학, 국어점수를 입력받아 출력한다.
	int score[3][2]; // [x][y] = x는 학생 y는 점수를 의미한다.
	int i, j;

	i = n번째 학생
	j = 점수

		for(i = 0; i<3; i++)
	{
		for(j=0; j < 2; j++)
		{
			if(j == 0)
			{
				printf("%d번째 학생의 국어점수를 입력하세요 : ", i+1);
				scanf("%d", &score[i][j]);
			}
			if(j == 1)
			{
				printf("%d번째 학생의 영어점수를 입력하세요 : ", i+1);
				scanf("%d", &score[i][j]);
			}
		}
	}

		for(i = 0; i<3; i++)
	{
		printf("%d 번째 학생의 국어점수 : %d, 영어점수 : %d\n", i+1, score[i][0], score[i][1]);
	}

	c에서 다차원 배열은 맨 앞의 크기를 제외한 나머지 크기들을 정확히 지정해야 오류가 발생하지 않는다.
	*/

    /*
	[0][0][0][1][0][2] >> 1 2 3
	[1][0][1][1][1][2] >> 4 5 6
	[0][0][0][0][0][0] >> 7 8 9

	컴퓨터 메모리 상에선 배열이 절대로 이차원 적으로 만들어 지지 않는다.
	컴퓨터 메모리는 일렬로 된 데이터들의 나열이 존재할 뿐이다.
	메모리에서 2차원 배열을 그려보면 아래와 같다
	arr[0][0]
	arr[0][1]
	arr[0][2]
	arr[1][0]
	arr[1][1]
	arr[1][2]
	arr[2][0]
	arr[2][1]
	arr[2][2]

	그럼 왜 이차원 배열이라 부를까? 이유는 단순하다.
	이차원으로 배열되어 있다 생각하면 도식화하기 쉬워서다.
	arr[2][1]을 컴퓨터는 3*2 + 1 = 7 번째에 있는 값이라 생각한다.
	하지만 arr[2][1]을 2행 1열에 있는 값이라 생각하면 편해서 이차원으로 생각하는거다.

	printf("arr 배열의 2 행 3 열의 수를 출력 : %d\n", arr[1][2]);
	printf("arr 배열의 1 행 2 열의 수를 출력 : %d\n", arr[0][1]);
	*/
}