#include <stdio.h>

int main_void(void)
{
    // 다차원 배열
    /*
	
	
	*/
    int i;
    // ⬜ 메모리공간 1개 할당

    int arr[5] = {1, 2, 3, 4, 5};
    // ⬜⬜⬜⬜⬜ 메모리공간 5개 할당

    printf("1차원 배열 : %d %d %d %d %d\n", arr[0], arr[1], arr[2], arr[3], arr[4]);

    int arr2[2][5] =
        {
            {1, 2, 3, 4, 5}, {6, 7, 8, 9, 10}};
    printf("2차원 배열 : %d %d %d %d %d %d %d %d %d %d\n", arr2[0][0], arr2[0][1], arr2[0][2], arr2[0][3], arr2[0][4], arr2[1][0], arr2[1][1], arr2[1][2], arr2[1][3], arr2[1][4]);

    // ⬜⬜⬜⬜⬜ 메모리공간 5개 할당
    // ⬜⬜⬜⬜⬜ 메모리공간 5개 할당
    // 총합 10개 할당 즉 "5개 메모리공간"을 2번 할당

    int arr3[4][2] =
        {
            {11, 12}, {13, 14}, {15, 16}, {17, 18}};

    printf("2차원 배열 : %d %d %d %d %d %d %d %d\n", arr3[0][0], arr3[0][1], arr3[1][0], arr3[1][1], arr3[2][0], arr3[2][1], arr3[3][0], arr3[3][1]);
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // 총합 8개 할당 즉 "2개 메모리 공간"을 4번 할당

    int arr4[3][3][3] =
        {
            {{1, 2, 3},
             {4, 5, 6},
             {7, 8, 9}},

            {{10, 11, 12},
             {13, 14, 15},
             {16, 17, 18}},

            {{19, 20, 21},
             {22, 23, 24},
             {25, 26, 27}}};

    /*
	{	
		{
			{1차원 배열}, {1차원 배열}, {1차원 배열} >> 1차원 배열 3개 묶은 것이 2차원 배열, 2차원 배열 1개 묶음을 묶은 것이 3차원 배열 
		}
		
		{
			{1차원 배열}, {1차원 배열}, {1차원 배열}
		},
		
		{
			{1차원 배열}, {1차원 배열}, {1차원 배열}
		}
	};


	{
			{1차원 배열}, {1차원 배열}, {1차원 배열} >> 1차원 배열 3개 묶은 것이 2차원 배열, 2차원 배열 1개 묶음을 묶은 것이 3차원 배열
	}

	3차원 배열이 위의 것 1개이며 3차원 배열이 현재 3개 존재한다.
	*/
    printf("3차원 배열 : %d %d %d %d %d %d %d %d %d\n",
           arr4[0][0][0], arr4[0][0][1], arr4[0][0][2], arr4[0][1][0], arr4[0][1][1], arr4[0][1][2], arr4[0][2][0], arr4[0][2][1], arr4[0][2][2]);

    printf("3차원 배열 : %d %d %d %d %d %d %d %d %d\n",
           arr4[1][0][0], arr4[1][0][1], arr4[1][0][2], arr4[1][1][0], arr4[1][1][1], arr4[1][1][2], arr4[1][2][0], arr4[1][2][1], arr4[1][2][2]);

    // ⬜⬜⬜ //
    // ⬜⬜⬜
    // ⬜⬜⬜

    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜

    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // 총합 27개 할당 즉 "3개 메모리 공간"을 3번 할당 뒤 9개 묶음을 3번 할당

    int arr5[2][10][3] =
        {
            {{1, 2, 3},
             {4, 5, 6},
             {7, 8, 9},
             {10, 11, 12},
             {13, 14, 15},
             {16, 17, 18},
             {19, 20, 21},
             {22, 23, 24},
             {25, 26, 27},
             {28, 29, 30}},

            {{1, 2, 3},
             {1, 2, 3},
             {1, 2, 3},
             {1, 2, 3},
             {1, 2, 3},
             {1, 2, 3},
             {1, 2, 3},
             {1, 2, 3},
             {1, 2, 3},
             {1, 2, 3}}};
    printf("\n\n---------------------------------\n");
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            for (int k = 0; k < 3; k++)
            {
                printf("3차원 배열 (%d, %d, %d)의 값 : %d\n", i, j, k, arr5[i][j][k]);
            }
            printf("\n");
        }
        printf("\n");
    }

    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜

    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // ⬜⬜⬜
    // 총합 60개 할당 즉 3개 메모리 공간을 10번 할당뒤 10개 묶음을 2번 할당

    int arr6[7][4][2];
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜

    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜

    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜

    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜

    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜

    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜

    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // ⬜⬜
    // 총합 56개 할당 즉 "2개 메모리 공간"을 4번 할당 뒤 8개 묶음을 7번 할당

    return 0;
}